{
  "nodes": [
    {
      "op": "null", 
      "name": "one", 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(-1, 1)"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "anchor", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv0_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "32"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc", 
      "attrs": {"num_hidden": "1024"}, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "L2Normalization", 
      "name": "l2normalization0", 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "diff", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "32"
      }, 
      "inputs": [[23, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling6", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32"
      }, 
      "inputs": [[26, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling7", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32"
      }, 
      "inputs": [[29, 0, 0], [13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling8", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten2", 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc", 
      "attrs": {"num_hidden": "1024"}, 
      "inputs": [[33, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "L2Normalization", 
      "name": "l2normalization2", 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus1", 
      "inputs": [[22, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1", 
      "inputs": [[36, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum1", 
      "attrs": {
        "axis": "1", 
        "keepdims": "1"
      }, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "same", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "32"
      }, 
      "inputs": [[39, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling3", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32"
      }, 
      "inputs": [[42, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling4", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32"
      }, 
      "inputs": [[45, 0, 0], [13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling5", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten1", 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc", 
      "attrs": {"num_hidden": "1024"}, 
      "inputs": [[49, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "L2Normalization", 
      "name": "l2normalization1", 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus0", 
      "inputs": [[22, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul0", 
      "inputs": [[52, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum0", 
      "attrs": {
        "axis": "1", 
        "keepdims": "1"
      }, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus2", 
      "inputs": [[38, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus3", 
      "inputs": [[1, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation9", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss0", 
      "inputs": [[57, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    4, 
    8, 
    9, 
    13, 
    14, 
    19, 
    20, 
    23, 
    39
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62
  ], 
  "heads": [[58, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10201]}
}